# Combining and Exporting Data 
# A

## Contents

1- Merging Prepared Orders Data with the New orders_product_prior DataFrame¶

2- Exporting the Merged File in Pickle Format as “orders_products_combined.pkl”

In [1]:
import pandas as pd
import os
import numpy as np

In [2]:
path = r'/Users/calebhill/09:01:2023 - Instacart Basket Analysis'

In [3]:
df_ords_prior = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'orders_products_prior.csv'))
df_ords = pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'orders_checked.csv'), index_col = 0)
df_prods = pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'products_checked.csv'), index_col = 0)

## 1) Merging Prepared Orders Data with the New orders_product_prior DataFrame

In [4]:
df_ords_prior.value_counts(dropna = False)

order_id  product_id  add_to_cart_order  reordered
2         1819        8                  1            1
2280875   37027       4                  1            1
          28851       3                  1            1
          16518       1                  1            1
          16260       2                  1            1
                                                     ..
1141412   47209       1                  1            1
          45066       5                  0            1
          34126       10                 1            1
          32177       4                  1            1
3421083   45309       2                  0            1
Name: count, Length: 32434489, dtype: int64

In [42]:
df_ords_prior.head()

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [43]:
df_ords_prior.shape

(32434489, 4)

In [44]:
df_ords.shape

(3421083, 6)

In [45]:
df_ords.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_last_order
0,2539329,1,1,2,8,NaN
1,2398795,1,2,3,7,15.0
2,473747,1,3,3,12,21.0
3,2254736,1,4,4,7,29.0
4,431534,1,5,4,15,28.0

In [46]:
#merges the two dataframes using the order_id column
df_merged_large = df_ords.merge(df_ords_prior, on = 'order_id', indicator = True)

In [47]:
df_merged_large.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_last_order,product_id,add_to_cart_order,reordered,_merge
0,2539329,1,1,2,8,NaN,196,1,0,both
1,2539329,1,1,2,8,NaN,14084,2,0,both
2,2539329,1,1,2,8,NaN,12427,3,0,both
3,2539329,1,1,2,8,NaN,26088,4,0,both
4,2539329,1,1,2,8,NaN,26405,5,0,both

In [48]:
df_merged_large['_merge'].value_counts()

_merge
both          32434489
left_only            0
right_only           0
Name: count, dtype: int64

In [50]:
df_merged_large.shape

(32434489, 10)

## 2) Exporting the Merged File in Pickle Format as “orders_products_combined.pkl”

In [49]:
df_merged_large.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'orders_products_combined.pkl'))